Repository: jorgeRumilly/sj4webcleaningdb
Catalog: translations/*/ModulesSj4webcleaningdbAdmin.*.xlf
Languages: fr_fr

source: SJ4WEB - PrestaShop DB Cleanup
fr_fr: SJ4WEB - Nettoyage BDD PrestaShop

source: Cleans specific tables based on a retention period. Manual or CRON execution. Logs available.
fr_fr: Nettoie certaines tables selon une durée de rétention. Exécution manuelle ou via CRON. Logs consultables.

source: DB Cleanup Logs
fr_fr: Logs Nettoyage BDD

source: DB Cleanup
fr_fr: Nettoyage BDD

source: Configuration saved.
fr_fr: Configuration enregistrée.

source: Cleanup completed. Check the logs.
fr_fr: Nettoyage exécuté. Consultez les logs.

source: Optimization only completed.
fr_fr: Optimisation seule exécutée.

source: Database cleanup settings
fr_fr: Configuration du nettoyage BDD

source: Enable automatic cleanup
fr_fr: Activer le nettoyage automatique

source: Enable table optimization
fr_fr: Activer l’optimisation des tables

source: Yes
fr_fr: Oui

source: No
fr_fr: Non

source: Backup tables before deletion
fr_fr: Sauvegarder les tables avant suppression

source: Creates a copy of deleted rows in a `_save_` table before deletion.
fr_fr: Crée une copie des lignes supprimées dans une table `_save_` avant suppression.

source: Save configuration
fr_fr: Enregistrer la configuration

source: Clean now
fr_fr: Nettoyer maintenant

source: Optimize tables now
fr_fr: Optimiser les tables maintenant

# clean_table_label
source: Clean table "%s"
fr_fr: Nettoyer la table "%s"

# enable_cleanup_desc
source: Enable cleanup for table "%s".
fr_fr: Activer le nettoyage de la table "%s".

# retention_label
source: Retention period for "%s"
fr_fr: Durée de conservation pour "%s"

source: days
fr_fr: jours

source: All rows older than this delay will be deleted (if the table is selected).
fr_fr: Toutes les lignes antérieures à ce délai seront supprimées (si la table est cochée).

source: Log archiving / deletion
fr_fr: Archivage / Suppression des logs

source: Log retention period (months)
fr_fr: Durée de conservation des logs (mois)

source: Older log files will be automatically deleted.
fr_fr: Les fichiers de logs plus anciens seront automatiquement supprimés.

source: Access logs
fr_fr: Accéder aux logs

source: Use this link to access the logs
fr_fr: Utilisez ce lien pour accéder aux logs

source: View logs
fr_fr: Voir les logs

source: CRON task
fr_fr: Tâche CRON

source: Use this link in a CRON if cleanup is enabled. Click the link to copy it.
fr_fr: Utilisez ce lien dans un CRON si le nettoyage est activé. Cliquez sur le lien pour copier.

source: Link copied to clipboard!
fr_fr: Lien copié dans le presse-papier !

source: Table-specific cleanup
fr_fr: Nettoyage par table

source: Keep data for
fr_fr: Conserver les données pendant

source: No log file available at the moment.
fr_fr: Aucun fichier de log disponible pour le moment.

source: Available log files
fr_fr: Fichiers de log disponibles

source: Deleted rows
fr_fr: Suppressions

source: Optimization
fr_fr: Optimisation

source: Origin
fr_fr: Origine

source: Before (MB)
fr_fr: Avant (Mo)

source: After (MB)
fr_fr: Après (Mo)

source: Gain (MB)
fr_fr: Gain (Mo)

source: No operations detected in this log file.
fr_fr: Aucune opération détectée dans ce fichier de log.

source: Raw content of the log file
fr_fr: Contenu brut du fichier log

source: Current status of cleaned tables
fr_fr: État actuel des tables traitées

source: Number of rows
fr_fr: Nombre de lignes

source: Size (MB)
fr_fr: Taille (Mo)

source: Log viewer
fr_fr: Consultation des logs

source: Log date
fr_fr: Date des logs

source: Choose the log date to display.
fr_fr: Choisissez la date du log à afficher.

source: Display logs
fr_fr: Afficher les logs

source: [$now] Table %table% | Removed inactive carts older than %days% days | Deleted: %count%
fr_fr: [$now] Table %table% | Suppression paniers inactifs > %days% jours | Supprimés : %count%

source: [$now] Table %table% | Removed orphans (%foreignKey%) | Deleted: %count%
fr_fr: [$now] Table %table% | Suppression orphelins (%foreignKey%) | Supprimés : %count%

source: [$now] Table %table% | Removed entries older than %days% days | Deleted: %count%
fr_fr: [$now] Table %table% | Suppression > %days% jours | Supprimés : %count%

source: [$now] Table %full% | OPTIMIZE error:
fr_fr: [$now] Table %full% | Erreur OPTIMIZE :

source: %tag% [%now%] Table %full% | Check + Analyze + Optimize + Rebuild OK | Flush: %flush%
fr_fr: %tag% [%now%] Table %full% | Check + Analyse + Optimisation + Rebuild OK | Flush : %flush%

source: [$now] Table %full% | Size before: %before% MB | Size after: %after% MB | Saved: %gain% MB
fr_fr: [$now] Table %full% | Taille avant : %before% Mo | Taille après : %after% Mo | Gain : %gain% Mo

source: [$now] Optimization globally disabled.
fr_fr: [$now] Optimisation désactivée globalement.

source: [$now] Table %full% | Size before: %before% MB | Size after: ... MB
fr_fr: [$now] Table %full% | Taille avant : %before% Mo | Taille après : ... Mo

source: [$now] Table %full% | No processing defined.
fr_fr: [$now] Table %full% | Aucun traitement défini.

source: [$now] Cleanup globally disabled.
fr_fr: [$now] Nettoyage désactivé globalement.
